{
  "title": "Account Manager",
  "location": "Barcelona, Spain",
  "type": "Full-time",
  "description": "<h2>Introduction</h2><p>Peter & Sons is a game development studio formed by an international group of professionals and game enthusiasts with broad experience in mobile, play to earn casual game development and slot games. We work with world-class artists, programmers, mathematicians and musicians to produce some of the most innovative, creative, and entertaining casino games on the market.</p><p>Here is a unique opportunity to join a highly ambitious company with offices in Yerevan and Barcelona. Our agile development teams possess a variety of different skills, nationalities and personalities.</p><h2>What you will do</h2><p>Peter & Sons is expanding its commercial team and looking to hire an Account Manager to the team. We're looking for a self-starter and driven individual that understands the needs and services required for each partner to ensure ongoing growth and value for both parties.</p><p>It is key that this person can build relationships with different stakeholders within the organizations ranging from high level customer support to CEO's or Founders of the companies. As an Account Manager you will be responsible for your personal growth and improvements to ensure your skillset is fine tuned to deliver high quality service to your portfolio of clients.</p><ul><li>Responsible for driving and maximizing revenues on assigned customers;</li><li>Analyse the clients' performance using statistics;</li><li>Develop strong customer relationships with relevant stakeholders within the customers;</li><li>Act as main point of contact within the organization for your customers;</li><li>Develop sector and market expertise and take a consultative approach to gain a clear understanding of the customers' business drivers and requirements;</li><li>Continual monitoring of user feedback to anticipate business needs and forward them to the Product department;</li><li>Organize and/or represent the company at events and exhibitions tailored to online gambling operators;</li><li>Regularly report KPIs, status of accounts to company stakeholders.</li></ul><h2>Who are we looking for</h2><ul><li>Ideally gaming experience, with previous experience within the online B2B industry as a Sales person or Account Manager;</li><li>Self-starter and motivated to succeed individual with highly developed social and communication skills;</li><li>Strong negotiation skills;</li><li>Able to handle top tier clients and the pressure that comes along with it;</li><li>A problem solver proactive approach;</li><li>Ability to cope with a fast-pace, complex and rapidly changing environment;</li><li>Commercially minded, with strong analytical / numerical skills;</li><li>Excellent verbal and written communication skills;</li><li>Proficiency in English, additional languages are appreciated.</li></ul>"
}