{
  "title": "Designer / Mathematician",
  "location": "Barcelona/Yerevan",
  "type": "Full-time",
  "description": "<h2>Introduction</h2><p>Here is a unique opportunity to join a highly ambitious company with offices in Yerevan and Barcelona. Our agile development teams possess a variety of different skills, nationalities and personalities.</p><p>We pride ourselves on our products pushing the expectations of the industry and standing out in the crowd. You will be joining a team with a goal to push the online casino experience further into unexplored territory than ever before. As part of the team you will collaborate daily with producers, artists, mathematicians and fellow programmers, participating fully in the creative process. We have a seat waiting for you.</p><h2>What you will do</h2><p>At Peter & Sons, we strive to create the optimal developer experience. Since every individual has unique needs and desires we simply stay out of the way. Choose the equipment, tools and schedule that works best for you and your team. You will play an important role in deciding how we work, but here is an idea of what your day will look like:</p><p>We are looking for a Game Designer Senior Mathematician to join our team. You will be defining the next generation of gaming by blending your industry experience with innovative mathematical logic and creativity.</p><ul><li>Innovating, You will be thinking and creating new mechanics and designs to entertain our players.</li><li>You will be working with different teams and people to help create the next generation of leading games</li><li>Conceptualising and implementing game designs and creating mathematical models that align with defined constraints and exhibit predetermined behavioural characteristics.</li><li>Communicating and ensuring the implementations are aligned with the game designs.</li><li>Implement the configurations for the game modes using our frameworks and tools.</li><li>Execute simulations of specific game features are created to supplement the theoretical calculation.</li><li>Test mathematical outcomes to assure quality and that accurate calculations are achieved.</li><li>Review games and feedback to the team as they are implemented to ensure that they reflect the correct math model, and make adjustments as needed during development to create world class math models.</li><li>Analyse performance data from the marketplace to help identify future game mechanics and industry trends</li><li>Analyse games performance post launch and provide insights about customers behaviour</li></ul><h2>Who we are looking for</h2><ul><li>You have been working with Slot machine game mathematical design, primarily focused on slots and has led and executed the design of previous successful games in the market</li><li>Has designed, or been involved in the design, of 20+ games with a wide variety of machine types and math models</li><li>Has a Bachelor's degree in Mathematics, Computer Science, or equivalent experience</li><li>Proven track record of developing successful game concepts. Previously delivered top performing slot games for land based or online companies</li><li>An advanced user of MS Excel, comfortable creating and adapting large and complex spreadsheets</li><li>Worked with programming teams to create or adapt simulation programs in a variety of languages –java, C, C++ etc</li><li>Has strong expertise in Combinatorics, Probability Theory and Statistics</li><li>Has knowledge of object-oriented program design</li><li>Has a long-standing passion for playing games of multiple genres, and passion in slots and casino games</li><li>Strong written and verbal communication skills in English</li></ul>"
}