{
  "title": "Full Stack Developer",
  "location": "Barcelona/Yerevan",
  "type": "Full-time",
  "description": "<h2>Introduction</h2><p>Peter & Sons is a game development studio formed by an international group of professionals and game enthusiasts with broad experience in mobile, play to earn casual game development and slot games. We work with world-class artists, programmers, mathematicians and musicians to produce some of the most innovative, creative, and entertaining games on the market.</p><p>Here is a unique opportunity to join a highly ambitious company with offices in Yerevan and Barcelona. Our agile development teams possess a variety of different skills, nationalities and personalities.</p><h2>Responsibilities</h2><ul><li>Design and implement software and infrastructure solutions with high quality, reliability and scalability in mind</li><li>Write clean and easy to maintain code for backend applications in node.js using TypeScript</li><li>Implementing REST and GraphQL APIs to connect internal microservices and external systems</li><li>FrontEnd development in React for Back Office system and in-game promotional tools</li><li>Integration and onboarding process for B2B customers</li><li>IT operations including infrastructure, service management, monitoring, releases</li><li>Define and manage the QA/QC testing process for all software and hardware releases</li><li>Set up and maintain monitoring dashboards with system key performance indicators</li></ul><h2>Must have</h2><ul><li>3+ years of experience with development of backend applications with Node.js and Typescript</li><li>2+ years of experience with cloud (Google Cloud Platform) and infrastructure management tools (Terraform, Kubernetes, Docker)</li><li>Experience with relational databases (Postgres)</li></ul><h2>Nice to have</h2><ul><li>Experience with GraphQL</li><li>Experience with in-memory databases (i.e. Redis)</li><li>IT administration skills</li><li>Experience with monitoring solutions such as Grafana or Stackdriver</li><li>Experience with Big Data solutions such as BigQuery</li></ul>"
}