{
  "title": "Game Programmer",
  "location": "Barcelona/Yerevan",
  "type": "Full-time",
  "description": "<h2>Introduction</h2><p>Here is a unique opportunity to join a highly ambitious company with offices in Yerevan and Barcelona. Our agile development teams possess a variety of different skills, nationalities and personalities.</p><p>We pride ourselves on our products pushing the expectations of the industry and standing out in the crowd. You will be joining a team with a goal to push the online casino experience further into unexplored territory than ever before. As part of the team you will collaborate daily with producers, artists, mathematicians and fellow programmers, participating fully in the creative process. We have a seat waiting for you.</p><h2>What you will do</h2><p>At Peter & Sons, we strive to create the optimal developer experience. Since every individual has unique needs and desires we simply stay out of the way. Choose the equipment, tools and schedule that works best for you and your team. You will play an important role in deciding how we work, but here is an idea of what your day will look like:</p><ul><li>Working with modern open web technologies such as HTML5, ES6+, TypeScript and WebGL</li><li>Supporting evergreen browsers and devices only</li><li>Assess, maintain and strive to improve the quality of code via:</li><li>Pull Requests</li><li>Creating lightweight functional-style JavaScript, TypeScript</li><li>Using ECS (entity component system) pattern and Cocos Creator editor (experience in Unity is a big plus)</li><li>Analysing and debating design patterns</li><li>Have a say in how we do things, vote on code style guidelines, convince us that your approach is the right one</li><li>Being involved in all processes and decision making</li><li>Communicating over GitHub, Slack, Google Hangouts, Skype, …</li><li>Take responsibility, be proactive, don't sit and wait to be given tasks. Instead openly promote and put forward a plan or proposal. Lead, don't follow. Promote open, constructive dialogue and encourage</li></ul><h2>Who we are looking for</h2><p>You have worked on interesting and successful game projects in JS and have stories to share of what you've learned along the way. You feel most at home in highly collaborative environments and are hungry to learn and share. You are open minded, honest and dependable, and take pride in what you create.</p><ul><li>Can create visually rich and highly performant games</li><li>Comfortable making and communicating important architectural decisions</li><li>Experienced in an environment where code quality is a high priority</li><li>Experienced working with casino game platforms and interested in how they are evolving</li><li>Experienced working across different devices in a mobile first manner</li><li>Excited to push devices to their limits</li><li>Have the passion to learn and stay at the cutting edge of what's possible</li><li>Happy to take the initiative in situations of uncertainty</li><li>Eager to step up and take ownership of things that need to be done</li><li>Have ideas for new, better ways to approach game development</li></ul>"
}