{
  "title": "Marketing Artist",
  "location": "Barcelona/Yerevan/Remote",
  "type": "Full-time",
  "description": "<h2>Introduction</h2><p>As a Marketing Artist, you will play a crucial role in producing visually captivating assets for our multichannel marketing campaigns. You will be responsible for curating, enhancing, and creating video and photo content from live-action seasons, as well as crafting in-game materials like posters, trailers, and live-action footage for new seasons. Your creative contributions will actively shape our marketing endeavours, as you bring fresh ideas to the team and explore innovative concepts. Additionally, you will stay at the forefront of emerging tools and technologies to elevate our creative production processes.</p><p>Join our dynamic team of creatives and contribute to our innovative marketing strategies. If you're a forward-thinking Marketing Artist with a passion for pushing creative boundaries and an expert-level command of Adobe Creative Suite, we'd love to hear from you. Your contributions will play a pivotal role in elevating our brand's visual identity and engagement with our audience.</p><h2>Location</h2><p>We are looking for a talented Marketing Artist to join our team at our offices in either Barcelona or Yerevan. Alternatively, we are open to considering remote candidates who can collaborate effectively with our global team.</p><h2>Responsibilities</h2><ul><li>Create and optimise visually appealing assets for multichannel marketing activities.</li><li>Gather, organise, and edit video and photo content from live-action seasons, ensuring high-quality outputs.</li><li>Develop and enhance in-game content, including posters, trailers, and live-action footage, to support new seasons.</li><li>Collaborate with the team to introduce and explore creative ideas, contributing to the evolution of our marketing strategies.</li><li>Stay updated on emerging tools and technologies, such as Gen-AI image, video, and voice technologies, and apply them to enhance creative production workflows.</li></ul><h2>Skills and Experience</h2><ul><li>Proven professional experience with Adobe Premiere, Photoshop, Illustrator, and After Effects, showcasing your mastery of these tools. Your deep understanding of these programs will empower you to create visually stunning and impactful marketing assets.</li><li>Proficiency in video editing, graphic design, and motion graphics, allowing you to create captivating visuals that engage our target audience.</li><li>A proactive self-starter attitude, combined with a willingness to work collaboratively in a small team environment.</li><li>Exceptional artistic sensibilities and meticulous attention to detail, ensuring the highest level of visual quality in all outputs.</li><li>Ability to think with a commercial mindset, aligning your creative decisions with our overall marketing objectives.</li><li>Strong understanding of composition and color theory, enabling you to craft visuals that are not only aesthetically pleasing but also strategically impactful.</li></ul><h2>Selection Process</h2><ul><li>Applicants must submit a CV and a portfolio showcasing their work, highlighting their expertise in video editing, graphic design, and motion graphics. The portfolio should demonstrate advanced proficiency with Adobe Premiere or similar, Photoshop, Illustrator, and After Effects.</li><li>Shortlisted candidates will be required to complete a practical test designed to assess their skills and creativity in alignment with the role's responsibilities.</li></ul>"
}