{
  "title": "Senior Artist",
  "location": "Barcelona/Yerevan",
  "type": "Full-time",
  "description": "<h2>Introduction</h2><p>Here is a unique opportunity to join a highly ambitious company with offices in Yerevan and Barcelona. Our agile development teams possess a variety of different skills, nationalities and personalities.</p><p>We pride ourselves on our products pushing the expectations of the industry and standing out in the crowd. You will be joining a team with a goal to push the online casino experience further into unexplored territory than ever before. As part of the team you will collaborate daily with producers, artists, mathematicians and fellow programmers, participating fully in the creative process. We have a seat waiting for you.</p><h2>What you will do</h2><p>At Peter & Sons, we strive to create the optimal developer experience. Since every individual has unique needs and desires we simply stay out of the way. Choose the equipment, tools and schedule that works best for you and your team. You will play an important role in deciding how we work, but here is an idea of what your day will look like:</p><ul><li>Work closely with the rest of the team to create unique games that stand out and make a visual impact. As Senior Artist you will oversee all visual aspects of development across varied game projects from concept to release. You will set the visual direction of each product and maintain direction, consistency and quality at all times.</li><li>This is a very diverse \"hands on\" role. Creation of art assets and ensuring the art needs of each project are met in a timely manner. Scheduling resources and ensuring art assets are organized and tracked accordingly is also an important part of the role.</li><li>Another part of this role will also involve supervision of other artists [if/where/when required] providing guidance, clear direction, inspiration, feedback and mentoring. Potentially across multiple projects simultaneously ensuring high standards are achieved on each project.</li><li>This is a fantastic opportunity for an experienced artist to to work with a cutting edge dev team tasked with creating unique next generation I-gaming products.</li></ul><h2>Who we are looking for</h2><p>Previous experience as a Senior Artist/Art Director and know the tools of the trade. It is important that you have strong visual skills and a great eye for detail. Preferably you have a bachelor degree in Art/Animation/Design or extensive experience within a proven professional creative sector/industry.</p><ul><li>Creative and talented artists who is open to take on a number of challenges and want to break free from the typical traditional design and creation of online casino games.</li><li>Skilled at designing beautiful, easy to use graphic user interfaces that connect emotionally with the user – simplicity will be at the core of everything you do.</li><li>Up for rethinking and challenging standards, always with the user experience in mind.</li><li>Interested in design and follows the progression of design carefully, picking up new research and trends.</li><li>Used to working closely with developers for execution to perfection.</li><li>Detailed oriented, excellent attention to detail fluidly in Photoshop, illustrator and/or any other tool of choice.</li><li>You have a thing for the quirky in life and love coming up with amazingly crazy out of this world ideas, developing creative concepts and working with other talented creatives to bring new content to market.</li><li>Your true passion should be in creating visual content that makes people stop, think, engage and talk.</li><li>You are used to work within multidisciplinary teams. Working closely with Producers, Game programmers, Artists, Mathematicians/Designers, Musicians etc.</li><li>You have great verbal communication and teamwork skills and are capable of dissecting, communicating and provide clear constructive feedback.</li><li>Since our working language is English high proficiency in English, written and oral, paired with skills in clear effective communication is a must</li><li>Must have a passion for games!</li><li>You are engaged and driven to help create and develop Peter & Sons visual tone and voice, strengthening our overall brand message.</li></ul>"
}