{
  "title": "BlueOcean Gaming expands portfolio with Peter & Sons direct deal",
  "slug": "blueocean-gaming-expands-portfolio-with-peter-sons-direct-deal",
  "date": "2024-03-08",
  "image": "/uploads/62_BOG_PeterAndSons.gif",
  "excerpt": "BlueOcean Gaming expands portfolio with Peter & Sons direct deal BlueOcean Gaming is excited to announce its latest strategic collaboration with Peter & Sons, an",
  "content": "BlueOcean Gaming expands portfolio with Peter & Sons direct deal BlueOcean Gaming is excited to announce its latest strategic collaboration with Peter",
  "fullContent": "BlueOcean Gaming is excited to announce its latest strategic collaboration with Peter & Sons, an esteemed online casino software studio known for its innovative and high-performing video slots and casino games.\nPrior to this direct deal, Peter&Sons content was already distributed to BlueOcean Gaming client network via Bragg Gaming. Now, with this new collaboration, we are thrilled to further expand our portfolio and bring Peter&Sons’ exceptional content directly to our operators through the GameHub casino aggregation platform.\nFounded in 2019 by a team of international enthusiasts and professionals, Peter&Sons has quickly made a name for itself in the industry with its distinctive approach to game development. With a portfolio boasting over 30 games, including popular titles like Kaiser, Valkyries, Book of Books, and Barbarossa, Peter&Sons is dedicated to offering a diverse range of gaming experiences for every type of player and market.\n“We are thrilled to start this collaboration with Peter&Sons,” saysSara Turk, Head of Content – Gamehub at BlueOcean Gaming. “With provider’s reputation for delivering top-quality games, we are confident that their content, already known and loved by our players, will make a fantastic addition to our GameHub portfolio. This partnership reinforces our commitment to providing our clients with the most diverse and engaging gaming content available.”\nYann Bautista, Commercial Director, and Founder at Peter and Sons: “This partnership withBlue Ocean Gamingmarks a new chapter in our journey, propelling our games to a global audience. With over 30 titles, including standout favorites like Barbarossa and Book of Books, we’re set to redefine the gaming experience. This collaboration seamlessly blends the innovation of our games with Blue Ocean’s extensive network, promising an exciting future for players worldwide.”\nAbout Peter & Sons\nPeter and Sons is an international game development studio transforming online gambling with uniquely styled, high-performing video slots and casino games. With world-class mechanics, their games offer an unparalleled gaming experience. Featuring innovative features, stunning graphics, and top-notch audio, their games are aimed to captivate players, enhance enjoyment, and drive long-term engagement, delivering substantial value for both players and operators. As part of the SkillOnNet group, Peter and Sons serves the global gaming market including the largest regulated markets, ensuring compliance with all regulatory requirements.\nAbout BlueOcean Gaming\nBlueOcean Gaming is a B2B online casino software provider with more than 10 years of experience in the online gaming industry. Our mission is to deliver quality online casino software solutions for clients worldwide. Our game aggregation platform, also known as GameHub, allows casino operators to launch multiple game providers with a single API integration and offers more than 120 online casino, live casino, virtual sports, and sportsbook providers and a set of efficient additional features. Our White Label and Turnkey solutions provide clients with a complete suite of products and services required to start their own online casino."
}