{
  "title": "Dot Connections secures major aggregation deal with Peter & Sons",
  "slug": "dot-connections-secures-major-aggregation-deal-with-peter-sons",
  "date": "2024-07-18",
  "image": "/uploads/PS-and-DOT-005-2048x1151.jpg",
  "excerpt": "Dot Connections secures major aggregation deal with Peter & Sons Dot Connections, a fast-growing igaming aggregator, has signed a landmark agreement with Peter & Sons",
  "content": "Dot Connections secures major aggregation deal with Peter & Sons Dot Connections, a fast-growing igaming aggregator, has signed a landmark agreement w",
  "fullContent": "Dot Connections, a fast-growing igaming aggregator, has signed a landmark agreement with Peter & Sons to provide access to the studio’s engaging releases via its ACE platform.\nAs part of the deal, Dot Connections will elevate the reach of Peter & Son’s existing games by offering their entire portfolio for the first time and integrating all new titles at launch.\nThis promising collaboration will now see the provider’s creative line-up made available in Asia and LatAm markets via a single-API, with Ghost Father, Evil Devil and Gun Powder among highly anticipated additions to Dot Connections’ platform.\nFormed in 2019, Peter & Sons has been turning heads in the industry with its uniquely styled, high-performing video slots and casino games. The company creates some of the most innovative and entertaining titles on the market, boasting 38 live games across more than 16 markets including the UK, Sweden, Denmark and Ontario.\nDot Connections’ recent collaboration marks significant progress for the aggregator as it is entrusted to support the games providers’ growth in target markets.\nCora Chen, COO at Dot Connections, said: “We are pleased to be chosen by Peter & Sons to deliver its thrilling portfolio of games to more operators than ever.\n“In a short space of time, Peter & Sons has pushed the boundaries of the igaming industry, reimagining content in inventive and surprising ways. We look forward to watching this partnership flourish.”\nYann Bautista, commercial director and founder at Peter & Sons, said: “Dot Connections’ distinguished reputation stems from its exceptional portfolio of leading slot titles, which have resonated with players globally, and superior customer service\n“This collaboration presents an incredible opportunity to expand our audience and brings our innovative and stimulating slot offering to a broader audience across Asia and LatAm.”"
}