{
  "title": "Peter & Sons Expands Global Reach with Extended Partnership with EveryMatrix's CasinoEngine",
  "slug": "everymatrix-partnership-extension",
  "date": "2024-09-18",
  "image": "https://peterandsonsgames.com/wp-content/uploads/2024/09/Barbarrossa2_Facebook_post_1200x630px2-1.png",
  "excerpt": "Peter & Sons Expands Global Reach with Extended Partnership with EveryMatrix's CasinoEngine",
  "content": "Peter & Sons, the innovative game studio known for its uniquely styled and",
  "fullContent": "Peter & Sons, the innovative game studio known for its uniquely styled and engaging slot games, has announced an expanded partnership with EveryMatrix's CasinoEngine platform, significantly enhancing its global distribution capabilities.\n\nThis extended agreement builds upon the existing successful relationship between the two companies, enabling Peter & Sons to reach an even broader audience through EveryMatrix's extensive operator network.\n\nUnder the terms of the expanded partnership, Peter & Sons' complete portfolio of games will be made available to all CasinoEngine operators, including recent hits like Wild Duel™, Barbarossa 2™, and the upcoming Hellscape™.\n\nThe partnership extension comes at a crucial time for Peter & Sons as it continues to expand its market presence and establish itself as a leading provider of innovative casino content.\n\nYann Bautista, Business Development Manager at Peter & Sons, commented: \"Our partnership with EveryMatrix has been instrumental in our growth story, and we're excited to take this collaboration to the next level.\n\n\"This expanded agreement will allow us to reach more operators and players than ever before, while maintaining the high standards of service and support that EveryMatrix is known for.\n\n\"We're confident that our unique approach to game development, combining distinctive visuals with engaging mechanics, will continue to resonate with players across EveryMatrix's expanded network.\"\n\nAlin Dobre, COO of EveryMatrix Games, added: \"Peter & Sons has consistently demonstrated their ability to create innovative and engaging content that stands out in any casino lobby.\n\n\"Their games have performed exceptionally well on our platform, and we're delighted to strengthen our partnership. This extension aligns perfectly with our strategy of offering operators access to the most diverse and high-quality content available in the market.\""
}