{
  "title": "Peter and Sons Announces Strategic Agreement with Light & Wonder",
  "slug": "light-and-wonder-agreement",
  "date": "2024-10-04",
  "image": "https://peterandsonsgames.com/wp-content/uploads/2024/09/Barbarrossa2_Facebook_post_1200x630px2-1.png",
  "excerpt": "Peter and Sons Announces Strategic Agreement with Light & Wonder",
  "content": "Peter and Sons, a leading game development studio renowned for its innovative and visually captivating",
  "fullContent": "Peter and Sons, a leading game development studio renowned for its innovative and visually captivating slot games, has announced a strategic agreement with Light & Wonder, one of the world's largest gaming companies.\n\nThis landmark deal will see Peter and Sons' entire portfolio of games integrated into Light & Wonder's OpenGaming™ platform, significantly expanding the studio's global reach and market presence.\n\nThe agreement includes all of Peter and Sons' existing titles, including player favorites such as Wild Duel™, Barbarossa 2™, and Book of Books™, as well as upcoming releases. Light & Wonder's operator partners will have access to these games, bringing Peter and Sons' unique gaming experience to a broader audience.\n\nThis partnership represents a major milestone in Peter and Sons' growth strategy, providing access to new markets and strengthening its position in the global gaming industry.\n\nYann Bautista, Business Development Manager at Peter and Sons, said: \"Partnering with Light & Wonder is a game-changing moment for Peter and Sons. Their OpenGaming™ platform is one of the most respected and widely used in the industry, and this agreement will significantly increase our games' visibility and availability.\n\n\"We are confident that our unique approach to game development, combining stunning visuals with innovative mechanics, will resonate with Light & Wonder's extensive operator network and their players.\"\n\nSteve Mayes, Partnership Director at Light & Wonder, commented: \"Peter and Sons has established itself as one of the most creative and innovative game studios in the industry. Their games bring something truly unique to our OpenGaming™ platform, and we're excited to offer their content to our operator partners.\n\n\"This partnership aligns perfectly with our strategy of providing operators with the most diverse and high-quality content available in the market.\""
}