{
  "title": "Peter & Sons Bolsters Italian Market Presence Via Octavian Lab Deal",
  "slug": "octavian-lab-deal",
  "date": "2024-11-20",
  "image": "https://peterandsonsgames.com/wp-content/uploads/2024/09/Barbarrossa2_Facebook_post_1200x630px2-1.png",
  "excerpt": "Peter & Sons Bolsters Italian Market Presence Via Octavian Lab Deal",
  "content": "Award-winning game studio Peter & Sons has amped up its presence in the Italian",
  "fullContent": "Award-winning game studio Peter & Sons has amped up its presence in the Italian market after partnering with leading platform provider, Octavian Lab.\n\nThe deal means that Peter & Sons' full suite of slots will be made available to Octavian Lab's operator partners in the market, significantly increasing the reach of its content among Italian players.\n\nThis includes hit titles such as Wild Duel™, Barbarossa 2™ and Book of Books™ as well as the latest games to leave its production line including Atlantis Gold™ and Neptune's Riches™.\n\nThe integration has been completed and Peter & Sons' slots are now available to Octavian Lab's operator partners, allowing them to deliver even more entertainment and thrills to their players.\n\nYann Bautista, Business Development Manager at Peter & Sons, said: \"Italy is a key market for Peter & Sons and this partnership with Octavian Lab allows us to quickly establish ourselves as a leading provider.\n\n\"Our slots have been designed to deliver a thrilling player experience through stunning visuals and animations combined with smart math and mechanics. We look forward to seeing more Italian players enjoy our games.\"\n\nEmanuele Nocentelli, CEO at Octavian Lab, added: \"Peter & Sons is one of the most in-demand developers in the market right now so we are pleased to be able to offer its content to our operator partners.\n\n\"Its slots really are unique and stand out in any game lobby. They also deliver the excitement that players are seeking, making them a great addition to our game portfolio.\""
}