{
  "title": "Peter and Sons Announces Strategic Agreement with Light & Wonder",
  "slug": "peter-and-sons-announces-strategic-agreement-with-light-wonder",
  "date": "2024-10-04",
  "image": "/uploads/PS_LW_PR_Banner001.jpg",
  "excerpt": "Peter and Sons Announces Strategic Agreement with Light & Wonder Peter and Sons, a leading game development studio renowned for its innovative and visually captivating",
  "content": "Peter and Sons Announces Strategic Agreement with Light & Wonder Peter and Sons, a leading game development studio renowned for its innovative and vis",
  "fullContent": "Peter and Sons, a leading game development studio renowned for its innovative and visually captivating casino games, is thrilled to announce a new strategic deal with Light & Wonder, a premier iGaming supplier known for its robust and diverse game aggregation platform.\nThis collaboration aims to enhance Peter and Sons’ reach and visibility in the global iGaming market. Peter and Sons already holds licenses in the UK, Ontario (Canada), Denmark, Italy, Buenos Aires (Argentina), Spain and Malta, and will soon be entering regulated states in the USA.\nBy leveraging Light & Wonder’s extensive network and advanced aggregation technology, Peter and Sons will be able to distribute its unique gaming content to a broader audience, offering players in regulated markets around the world access to its acclaimed portfolio of games. This agreement marks a significant milestone for both companies with the opportunity for exciting developments in the dynamic world of iGaming.Maor Nutkevitch CEO of Peter and Sons stated: “We are excited to work with Light & Wonder, a leader in the iGaming aggregation space. This collaboration allows us to expand the distribution of our games, enabling us to showcase our innovative portfolio to a broader audience and provide players with an unparalleled gaming experience. We look forward to a successful collaboration that will drive growth and success for both companies.”Steve Mayes, Senior Director of Partnerships at Light & Wonder, added: “We are thrilled to welcome Peter and Sons to our aggregation platform. Their games are truly exciting, offering unique themes and gameplay that stand out in the market. Their commitment to quality and creativity aligns perfectly with our mission to provide the best gaming content to our clients. We believe this partnership will bring significant value to our network of operators and their players.”"
}