{
  "title": "Peter & Sons Rolls Out Award-Winning Content on 32Red",
  "slug": "peter-sons-rolls-out-award-winning-content-on-32red",
  "date": "2024-11-28",
  "image": "/uploads/PS_32_PR_Banner-002.jpg",
  "excerpt": "Peter & Sons Rolls Out Award-Winning Content on 32Red Award-winning game studio Peter & Sons’ acclaimed portfolio of slots titles are now live at leading",
  "content": "Peter & Sons Rolls Out Award-Winning Content on 32Red Award-winning game studio Peter & Sons’ acclaimed portfolio of slots titles are now live at lead",
  "fullContent": "Award-winning game studio Peter & Sons’ acclaimed portfolio of slots titles are now live at leading online casino 32Red.com. Thanks to a new content partnership, 32Red’s players will be able to sink their teeth into top hits like Barbarossa, as well as the soon-to-be released title Steamworks: The Workshop.\nSince its foundation in 2019, Barcelona and Yerevan – based Peter & Sons has been wowing the industry with a steady stream of games that dare to be different, drawing on a wide variety of rich themes and artistic styles with an emphasis on storytelling, audio-visual excellence and playability.\nThe studio, renowned for being consistently recognized at major industry events, picked up three honors at the MiGEA Malta iGaming Excellence Awards 2024, including Best New Slots Developer of the Year.\nWholly owned by the Kindred Group, 32Red has become a household name in the online casino space. The deal, which will further expand Peter & Sons’ presence in the UK and other regulated markets, comes off the back of a global distribution partnership with casino supply giant Light & Wonder, announced earlier this month.\nYann Bautista, Commercial Director & Founder at Peter & Sons said: “32Red and its parent, the Kindred Group, are major tier one operators in key regulated markets, and so this deal is another major milestone in the Peter & Sons story. We’re looking forward to enhancing this partnership by providing groundbreaking content for years to come.”\nAdam Newnham, Commercial Operations Manager at 32Red’s parent company Kindred Group, said:Peter & Sons is an extremely exciting studio who are not afraid to push the boundaries and experiment with strikingly original, even avant garde ideas. The result is that each game is a work of art, and we can’t wait for our players to experience them at 32Red."
}