{
  "title": "Peter & Sons Content Now Live on iGP’s iGaming Deck",
  "slug": "peter-sons-content-now-live-on-igp-s-igaming-deck",
  "date": "2024-05-20",
  "image": "/uploads/p_s_720.png",
  "excerpt": "Peter & Sons Content Now Live on iGP’s iGaming Deck New distribution deal brings Peter & Sons’ hit titles to iGP Innovative game studio Peter",
  "content": "Peter & Sons Content Now Live on iGP’s iGaming Deck New distribution deal brings Peter & Sons’ hit titles to iGP Innovative game studio Peter",
  "fullContent": "New distribution deal brings Peter & Sons’ hit titles to iGP\nInnovative game studio Peter & Sons’ state-of-the art portfolio of online casino content is now live on iGP’s aggregator solution iGaming Deck. The launch follows a new distribution partnership between the two companies that will deliver Peter & Sons’ hit titles via iGaming Deck’s seamless single API to iGPoperator partners around the world.\nThese include groundbreaking games likeBarbarossa, Book of Books, DragonBlox, and Peter Hunter.\nFormed in 2019 with a mission to embody “the anti-boring,” Peter & Sons has been turning heads in the industry with its uniquely styled, high-performing video slots and casino games. Now part of the SkillOnNet Group, the company works with world-class artists, mathematicians, and musicians to create some of the most innovative and entertaining titles on the market today.\nLikewise, iGP has grown rapidly since its formation in 2016, now powering more than 40 gaming operators. Its iGaming Deck is a centralized hub with more than 5,000 titles from both established brands and innovative challenger studios. The company’s mission is to empower iGaming operators to push boundaries with unparalleled flexibility, innovation, and speed.\nYann Bautista, Commercial Director and Founder of Peter & Sons, said:“It’s important for us to partner with industry leaders and tech pioneers, and iGP have proven that’s who they are with consistent innovation. The iGaming Deck is one of the standout aggregation platforms in the industry, which is why we wanted to be part of it.”\nInesa Glazaitėat iGP said:“It’s fantastic to announce iGaming Deck will be delivering new titles to our operators through this partnership. Peter & Sons’ games immediately grab you. Like us, the studio has always stood out from the crowd because they push the boundaries, reimagining gaming content in inventive and surprising ways. We’re delighted to carry their awesome content on our ever-expanding iGaming Deck. Together, we have high hopes for our partnership."
}