{
  "title": "Peter & Sons: adding a fresh twist to a classic with Barbarossa Revenge",
  "slug": "peter-sons-adding-a-fresh-twist-to-a-classic-with-barbarossa-revenge",
  "date": "2024-08-09",
  "image": "/uploads/Barbarrossa2_Facebook_post_1200x630px2-1.png",
  "excerpt": "Peter & Sons: adding a fresh twist to a classic with Barbarossa Revenge Yann Bautista, Founder & Commercial Director at Peter & Sons, reflects on",
  "content": "Peter & Sons: adding a fresh twist to a classic with Barbarossa Revenge Yann Bautista, Founder & Commercial Director at Peter & Sons, reflects on",
  "fullContent": "Yann Bautista, Founder & Commercial Director at Peter & Sons, reflects on the company’s journey from start-up to industry disruptor, and how its mantra of ‘doing things differently’ has shaped its newest title, Barbarossa Revenge.\nThe last few years have been filled with a whole lot of change for the igaming industry. We’ve seen plenty of new companies flood the market, new jurisdictions embrace the prospect of regulation and player preferences shape the development of new verticals.\nBut with all this change, gaming companies have faced the challenge of ensuring that they not only continue to stand out from the crowd, but that they are catering to the ever-changing needs of players. That’s much easier said than done.\nTo understand how Peter & Sons has gone about facing these challenges head on, I first need to take you back to the early days of the company.\nA mission to disrupt\nFounded back in 2019 by a team of gaming veterans, we vowed to do things a bit differently. That was a message that we aimed to convey in everything that we did – from partner relationships to game development. For us, taking a path less trodden would be the key to helping us stand out in an increasingly crowded space filled with slots developers.\nLike many other newly established studios, our early days were largely spent securing  agreements with distribution platforms. Without these, how would we broaden the reach of our games?\nWe were lucky enough to successfully sign distribution agreements with a number of industry leaders, including Yggdrasil YG Masters, Relax Silver Bullet and Oryx Blue Horn.\nWorking with such titans in the industry enabled us to exponentially increase our reach and exposure to brands across the globe, allowing Peter & Sons to quickly become a well-renowned studio.\nBut while we were busy securing distribution partnerships, we also wanted to solidify our presence as a studio that regularly releases player-favourite titles that feature innovative, disruptive mechanics and features, not to mention cinematic graphics and audio.\nBringing added excitement to the world of slots\nBy focusing on the look and ‘feel’ of each slot title, the team at Peter & Sons has not only added an additional layer of excitement to each title it has developed, but we have also given our partners the opportunity to provide unparalleled gaming experiences to each of their players.\nFollowing our initial successes with the distribution platforms, Peter & Sons entered the second phase of the company’s journey. This, we shall call the expansion phase. Our international recognition meant that we were able to secure a significant cash injection from a board of investors, acquire a best-in-class platform and were also able to begin acquiring key licences to engage directly with tier one operators.\nThis opened so many doors for us – in fact, in 2024, we are now livewith operators in multiple markets around the world, including Argentina, Denmark, Germany, Greece, Italy, Malta, Portugal, Spain, Sweden and the UK.\nBut that’s not all. In the coming months, we also have plans to take our content live in both New Jersey and Peru, bolstering our international footprint even further.\nWe have also been given the green light to take our content online with industry giants such as Hub88, IGT, Light & Wonder and Relax Gaming, as well as a range of tier one operators. You can probably understand why I refer to this as the ‘expansion phase’.\nNew levels of success\nAs you can see, we’ve hit a number of major milestones over the last five years. Among the number of titles that have contributed to Peter & Sons’ success is Barbarossa – a high volatility slot that includes our double multiplier feature.\nThis title is testament to the founders’ initial mission to deliver something different to the igaming industry. It included features and mechanics that, at the time, the industry had never seen before. Since its release, Barbarossa quickly became a favourite among players, delivering an unparalleled gaming experience with its engaging and innovative features.\nThe title invites players to set sail on a pirate adventure, braving shark-infested waters to uncover the ultimate treasure. This 5×3 grid slot game offers 243 Ways to Win and boasts a maximum payout of 20,000 times your bet!\nThe development of this new sequel, aptly named Barbarossa Revenge, has largely been centred around feedback from both players and operators. The team wanted to ensure that we are delivering on the wants and needs of our audience.\nGiven this significant level of popularity, we saw huge potential to deliver a sequel that moved the dial even further in terms of engagement. The newest title in our portfolio promises to introduce a new, super cool feature called Cannon Cashout, which almost guarantees a win when it appears – something that we are confident players will love!\nBarbarossa Revenge will deliver on every aspect that you would expect from a hit title; from the unique theme and experience-enhancing animations to the mechanics that make it a standout contender. It’s everything you would expect from a great sequel!\nWhen developing Barbarossa Revenge, we wanted to build on the success of the original game, maintaining similar gameplay with even higher volatility. We know that creating a sequel can be incredibly difficult – you just have to look at the film industry to see how true that is – so we’ve kept the beloved multiplier-building behaviour, allowing players to reach even bigger multipliers through multiple consecutive cascades. Ultimately, this provides an experience close to the original game while also delivering new and exciting experiences for players.\nWe wanted to make sure that Barbarossa Revenge is an epic continuation of the pirate adventure that we had created with the original Barbarossa, but this time with even more thrilling gameplay and opportunities for big wins.\nWe invite players to dive into this new experience and see why Barbarossa Revenge is set to become a favourite among players. Join us as we set sail on another unforgettable journey with Barbarossa.\nBarbarossa Revenge is due to be released on 1 October and will be made available across Yggdrasil’s distribution platform."
}