{
  "title": "Peter & Sons Expands Global Reach with Extended Partnership with EveryMatrix’s CasinoEngine",
  "slug": "peter-sons-expands-global-reach-with-extended-partnership-with-everymatrix-s-casinoengine",
  "date": "2024-09-18",
  "image": "/uploads/download.png",
  "excerpt": "Peter & Sons Expands Global Reach with Extended Partnership with EveryMatrix’s CasinoEngine Peter & Sons, the innovative game studio known for its uniquely styled and",
  "content": "Peter & Sons Expands Global Reach with Extended Partnership with EveryMatrix’s CasinoEngine Peter & Sons, the innovative game studio known for its uni",
  "fullContent": "Peter & Sons, the innovative game studio known for its uniquely styled and high-performing video slots, has expanded its global presence by extending its partnership withCasinoEngine, EveryMatrix’s market-leading iGaming productivity platform.\nThis new deal, facilitated through Peter & Sons’ proprietary platform, will provide EveryMatrix and its clients with access to Peter & Sons’ groundbreaking games, includingBarbarossa, Book of Books, DragonBlox,andSands of Destiny,alongside the studio’s growing portfolio of standout titles.\nFounded in 2019 with the mission to embody “the anti-boring,” Peter & Sons has rapidly become a favourite among players and operators across various markets. The studio’s collaboration with world-class artists, mathematicians, and musicians results in some of the most innovative and entertaining games in the industry.\nYann Bautista, Commercial Director and Founder of Peter & Sons, commented: “We’re thrilled to extend our partnership with EveryMatrix, one of the most respected names in the iGaming industry. Their CasinoEngine platform is a content powerhouse, and we’re excited to see our games reach an even broader audience through this partnership. This collaboration is a testament to our commitment to delivering high-quality, engaging content to players worldwide.”\nStian Enger Pettersen, CEO of Casino, EveryMatrix, said: “Peter & Sons’ games are known for their innovative design and captivating gameplay, and we’re delighted to integrate their content into our CasinoEngine platform. With more than 29,000 titles available across our aggregation network, CasinoEngine continues to offer the world’s most extensive games library. We’re confident that Peter & Sons’ titles will be a hit with our clients and their players, and we look forward to a long and successful partnership.”\nThis partnership with EveryMatrix is the latest in a series of strategic expansions for Peter & Sons, following recent deals with other leading iGaming platforms and operators. Peter & Sons continues to expand its presence across regulated gaming markets, ensuring full compliance with all regulatory standards.\nEditor’s Notes:\nAbout Peter & Sons\nPeter & Sons is an international game development studio that is transforming the online gambling industry with its uniquely styled, high-performing video slots and casino games. Founded in 2019 by a team of international enthusiasts and professionals, Peter & Sons stands out for its distinctive approach to casino game development. The studio serves the global gaming market, including the largest regulated markets such as the UK, Malta (MGA), Sweden, Greece, and Ontario, among others, ensuring full compliance with all regulatory requirements.Learn more athttps://peterandsonsgames.com/\nAbout EveryMatrix\nEveryMatrix delivers iGaming software, solutions, content and services for casino, sports betting, payments, and affiliate management to global Tier 1 operators as well as to newer brands. The platform is highly modular, scalable, and compliant, allowing operators to choose the optimal EveryMatrix solution and combine with third-party and in-house technology and capabilities.\nEveryMatrix empowers clients to unleash bold ideas and deliver outstanding player experiences in regulated markets. The company has 1,000 employees across 13 countries and serves 300+ customers worldwide, including the regulated U.S. market.\nEveryMatrix is a member of the World Lottery Association (WLA) and European Lotteries Association. In September 2023 it became the first iGaming supplier to receive WLA Safer Gambling Certification.\nEveryMatrix is proud of its commitment to safer gambling and player protection whilst producing market leading gaming solutions."
}