{
  "title": "Peter & Sons Bolsters Italian Market Presence Via Octavian Lab Deal",
  "slug": "peter-sons-bolsters-italian-market-presence-via-octavian-lab-deal",
  "date": "2024-11-20",
  "image": "/uploads/PS_Octavian_PR_Banner2.jpg",
  "excerpt": "Peter & Sons Bolsters Italian Market Presence Via Octavian Lab Deal Award-winning game studio Peter & Sons has amped up its presence in the Italian",
  "content": "Peter & Sons Bolsters Italian Market Presence Via Octavian Lab Deal Award-winning game studio Peter & Sons has amped up its presence in the Italian",
  "fullContent": "Award-winning game studio Peter & Sons has amped up its presence in the Italian market thanks to a new deal with Octavian Lab.\nRome-based software provider Octavian is a major supplier of igaming solutions to the Italian market, and the deal sees it become one of Peter & Sons’ main aggregate partners in Italy. The company powers big players like Entain-owned Eurobet, Snaitech, Sisal, Betfair and many others. Octavian Lab has recently received a special mention as best aggregator of the year during EGR Italy awards 2024.\nUnder the new partnership, Peter & Sons first went live with Italian gaming powerhouse Eurobet. Founded in 1995, the brand is an igaming pioneer, having offered digital betting since 1999. As a land-based sports betting operator, it’s one of the most recognizable gaming brands in Italy.\nPeter & Sons has been wowing the industry since its 2019 formation with a stream of games that dare to be different.\nDrawing on influences from everything from cult comic books and cartoons to obscure science fiction, and with an emphasis on storytelling, audio-visual excellence and playability, the maverick Barcelona-based studio is creating some of the most strikingly original and avant garde casino games on the market today.\nThe studio picked up three awards at the recent MiGEA Malta iGaming Excellence Awards 2024, including Best New Slots Developer of The Year.\nYann Bautista, Founder and Commercial Director at Peter & Sonssaid:“Our games have already proved popular in Italy, so to move forward with a really big player like Octavian Lab was the next logical step. Italy is a very exciting market that has doubled in size over the last seven years, and we’re thrilled to increase our reach significantly through this deal.”\nEmanuele Nocentelli, CEO at Octavian Lab said:“Our platform powers some of the biggest names in Italian gaming, and that means we always want leading-edge content. Peter & Sons are a breath of fresh air. There’s no one reimagining casino gaming quite like Peter & Sons, and the result is a portfolio of inventive and unparalleled games that have a unique power to delight.”"
}