{
  "title": "Peter & Sons Hits White Hat Gaming Via Light & Wonder Deal",
  "slug": "peter-sons-hits-white-hat-gaming-via-light-wonder-deal",
  "date": "2024-12-03",
  "image": "/uploads/PS_White-Hat_PR_Banner-002-1.jpg",
  "excerpt": "Peter & Sons Hits White Hat Gaming Via Light & Wonder Deal Innovative game studio Peter & Sons is now live on the White Hat",
  "content": "Peter & Sons Hits White Hat Gaming Via Light & Wonder Deal Innovative game studio Peter & Sons is now live on the White Hat",
  "fullContent": "Innovative game studio Peter & Sons is now live on the White Hat Gaming network in the UK, thanks to its recently formed strategic partnership with gaming giant Light & Wonder.\nThe deal will see Peter & Sons expand the distribution of its unique game portfolio through White Hat, which is a Light & Wonder aggregation partner, enhancing its reach and visibility to UK audiences.\nWhite Hat powers several online casinos in the regulated UK market, including PlayZee.com, CaptainSpins.com, and Casimba.com via its best-in-class PAM gaming platform.\nPlayers on those sites can now get stuck into Peter & Sons’ hit games like Barbarossa, Xibalba, Wild 1 and Voodoo Hex, as well as brand new titles like Muddy Waters and Barbarossa Revenge.\nFormed in 2019 with a mission to embody “the anti-boring,” award-winning Peter & Sons works with world-class artists, mathematicians, and musicians to offer unique-styled, high performing games. With influences ranging from cult comics and cartoons to obscure books and movies, the studio is building some of the most avant garde and entertaining casino games on the market today.\nYann Bautista, Founder and Commercial Director at Peter & Sons said:“The deal with Light & Wonder was a major milestone for Peter & Sons and going live with White Hat Gaming is the first phase in this exciting new chapter. White Hat Gaming is a major player in the industry in the UK and globally, and we believe this collaboration is a win-win for both our companies.”\nJamie Lees, Head of Content at White Hat Gaming said:“We’re huge fans of Peter & Sons’ work, which is why we’re thrilled to go live with their portfolio on our network. Their games break the mould and are unmatched when it comes to humour and storytelling. Our platform boasts an amazing range of games from 130 top providers, but none of them are quite like Peter & Sons.”"
}