{
  "title": "Peter & Sons Announce New Partnership with Relax Gaming as Latest Powered by Relax Partner",
  "slug": "peter-sons-announce-new-partnership-with-relax-gaming-as-latest-powered-by-relax-partner",
  "date": "2024-07-09",
  "image": "/uploads/PS-and-Relax-2048x1151.jpg",
  "excerpt": "Peter & Sons Announce New Partnership with Relax Gaming as Latest Powered by Relax Partner Peter & Sons, the international game development studio known for",
  "content": "Peter & Sons Announce New Partnership with Relax Gaming as Latest Powered by Relax Partner Peter & Sons, the international game development studio kno",
  "fullContent": "Peter & Sons, the international game development studio known for their uniquely styled, high-performing video slots and casino games, is excited to announce an agreement with the renowned iGaming aggregator, Relax Gaming. This partnership will see Peter & Sons become the latest Powered by Relax partner, a collaboration set to bring a fresh wave of excitement to the igaming market.\nExpanding Horizons Across Regulated Markets\nThe partnership with Relax Gaming will facilitate the distribution of Peter & Sons’ innovative content across various regulated markets, including the UK, Denmark, Sweden, Ontario, Greece and Malta Gaming Authority (MGA) jurisdictions. This strategic move will significantly enhance the reach of Peter & Sons’ distinctive games, bringing their creative and engaging experiences to a broader audience.\n“We are thrilled to join forces with Relax Gaming as a P2P partner,” said Yann Bautista Commercial Director of Peter & Sons. “This collaboration aligns perfectly with our mission to push the boundaries of game design and deliver unparalleled gaming experiences. With Relax Gaming’s robust platform and extensive network, we are confident that our games will captivate players across multiple markets.”\nBreaking New Ground in Visuals and Gameplay\nPeter & Sons have been breaking new grounds in visuals and gameplay, earning a reputation for their unique artistic style and innovative mechanics. The partnership with Relax Gaming will enable Peter & Sons to leverage Relax Gaming’s distribution capabilities, ensuring their high-quality games reach a wider audience while maintaining their commitment to excellence and creativity.\n“Relax Gaming’s reputation for excellence and their extensive network will enable us to showcase our games to a broader audience. We are eager to collaborate with their talented team and leverage their expertise to take our game distribution to the next level,” added Yann.\nRelax Gaming Director of Aggregation Commercials Nicholas Hammon said “Adding Peter and Sons’ premium range of content to our platform is an exciting collaboration. Peter and Sons’ distinctive approach to creating games and story telling is well recognised and loved by a wide range of players and they are a welcome addition to the Relax family.”\nAbout Peter & Sons\nPeter & Sons is a creative game development studio focused on delivering high-quality, unique, and engaging gaming experiences. Known for their artistic approach and innovative game mechanics, Peter & Sons aim to push the boundaries of traditional game development and bring fresh, exciting content to the market.\nAbout Relax Gaming\nRelax Gaming Group was founded in 2010 with the goal of simplifying B2B content delivery for the modern iGaming landscape. Relax Gaming provides more than 4,000 online casino games, from its proprietary slots to a diverse library of content from hand-picked third-party studios via its partnership programs."
}