{
  "title": "Peter & Sons’ latest creation is a cartoonish hellscape that’s devilishly good fun",
  "slug": "peter-sons-latest-creation-is-a-cartoonish-hellscape-that-s-devilishly-good-fun",
  "date": "2024-09-20",
  "image": "/uploads/Evil-Devil_PR-Banner.jpg",
  "excerpt": "Peter & Sons’ latest creation is a cartoonish hellscape that’s devilishly good fun Cutting-edge game studio Peter & Sons is about to unleash hell. The",
  "content": "Peter & Sons’ latest creation is a cartoonish hellscape that’s devilishly good fun Cutting-edge game studio Peter & Sons is about to unleash hell. The",
  "fullContent": "Cutting-edge game studio Peter & Sons is about to unleash hell. The Barcelona-based outfit’s diabolical new slot, Evil Devil, will be released globally on 19th September, and it comes packed with wickedly innovative mechanics, such as sticky respins, power splits, increasing multipliers, and a thrilling Free Spins Game with a possible buy option.\nThis 6×7 high-volatility video slot with up to 117,649 ways to win immerses players in a cartoonish hellscape presided over by the fiery lord Satan Sama. With a devilish surf guitar soundtrack and chaotic but gripping gameplay, there’s nothing else quite like it on the market.\nWinning combinations in the base game trigger the sticky respin feature, causing winning symbols to stick in place while the non-winning symbols respin. Wild symbols can appear on reels 2 to 6, increasing the chances of forming winning combinations.\nBut all hell breaks loose when 4 to 6 scatter symbols land on the reels, awarding 15 to 20 Free Spins. Here, winning symbols stick to their positions, triggering a respin of the non-winning symbols.\nCollecting three or more skull symbols during Free Spins triggers a random multiplier. Meanwhile, power splits can randomly occur during the first respin, converting winning symbols into wilds, enhancing the chances for some big payouts.\nCan’t wait to hit the bonus feature? The good news is you can buy straight into the Free Spins game for 100x the bet, instantly accessing 15 to 20 random free spins and the game’s most thrilling features.\nYann Bautista, Commercial Director and Founder at Peter & Sons said:“We’re always looking to push boundaries in everything we do, and we like to let our artists’ imaginations run wild. Too often with online slots you see the same tired themes and clichés. We think Evil Devil is an avant garde masterpiece – but it’s underpinned by solid mechanics and brilliant features.”"
}