{
  "title": "Peter & Sons to Enter Brazilian Market",
  "slug": "peter-sons-to-enter-brazilian-market",
  "date": "2025-02-11",
  "image": "/uploads/p_s_banner_brazil_final.jpg",
  "excerpt": "Peter & Sons to Enter Brazilian Market Award-winning game studio Peter & Sons is about to make waves in the freshly regulated Brazilian market. The",
  "content": "Peter & Sons to Enter Brazilian Market Award-winning game studio Peter & Sons is about to make waves in the freshly regulated Brazilian market. The",
  "fullContent": "Award-winning game studio Peter & Sons is about to make waves in the freshly regulated Brazilian market. The innovative iGaming content creator’s unique portfolio went live in Brazil from 1st January 2025 via PlayUZU.br and BacanaPlay.br.\nGlobal entertainment giant SkillOnNet recently announced it had been awarded a license to operate in the Brazilian market, which is quickly expected to become one of the biggest in the world.\nBarcelona-based Peter & Sons has already made significant inroads into Latin America, having recently debuted in Mexico, Peru, and Buenos Aires City in Argentina.\nBut Brazil will allow the studio to showcase its groundbreaking content to a truly massive new audience. Peter & Sons games are known for their rich storytelling, humour and unique artistic vision. Packed with fascinating themes, surprising mechanics, and glorious weirdness, they are designed to embody the ‘anti-boring’, according to the company.\nBrazilian players will soon be able to sink their teeth into hit games like Barbarossa, Xibalba, Wild 1 and Voodoo Hex, as well as brand new titles like Barbarossa Revenge, Muddy Waters, and Greedy Alice.\nAll content will be specially localized to the new market through two Portuguese-language, Brazil-focused platforms.\nYann Bautista, Commercial Director and Founder at Peter & Sons said:“While 2024 was a huge year for our global expansion, 2025 could prove to be the biggest yet, as we become an early entrant into this huge new market. Since our 2019 foundation, we have poured all our energy, hard work and inspiration into our games, and it’s truly exciting that our content reaches the massive audience that it does today.”\nPedro Garcia, Country Managerat BacanaPlay said:“We’re super-bullish about the Brazilian market, which has been projected by analysts to be worth almost$6.3bn by 2028. And we project thatthe addition ofPeter & Sons’ cutting-edge portfolio will go down a storm with Brazilian players at PlayUZU.br and BacanaPlay.br.”"
}