{
  "title": "Peter & Sons appoints Lauryn Duncan as Head of Sales and Marketing",
  "slug": "peter-sons-appoints-lauryn-duncan-as-head-of-sales-and-marketing",
  "date": "2024-05-10",
  "image": "/uploads/shutterstock_288715604-e1564386702119-696x391-1.webp",
  "excerpt": "Peter & Sons appoints Lauryn Duncan as Head of Sales and Marketing Duncan will be responsible for securing partnerships with clients across multiple jurisdictions, in",
  "content": "Peter & Sons appoints Lauryn Duncan as Head of Sales and Marketing Duncan will be responsible for securing partnerships with clients across multiple j",
  "fullContent": "Duncan will be responsible for securing partnerships with clients across multiple jurisdictions, in addition to managing relationships with partners at every level.\nHer sales, partnerships and team management experience spans several igaming companies, includingWazdan,Microgamingand most recently,Games Global.\nCommenting on her appointment, Duncan said: “This is a wonderful opportunity for me to be involved with Peter & Sons, which has fast become one of the most exciting slot game providers.\n“This is an incredible opportunity for me to join forces with Peter and Sons, a company that is fast becoming one of the most exciting slot providers. After working with many studios, one develops a sense of what sets exceptional studios apart, and Peter and Sons has that unique spark of a company in its breakthrough stage.”\nPeter & Sons has licences in the UK, Italy, Ontario, Sweden, Greece and Denmark. The studio is also set to go live in Spain, Portugal and New Jersey.\nYann Bautista, Commercial Director and Founder of Peter & Sons, added: “We are absolutely thrilled to welcome to our family someone of Lauryn’s calibre. Lauryn is joining at a pivotal moment for Peter & Sons, as we continue to strengthen our partnership roster.\n“In the last 12 months alone, we have integrated with more than 50 new operators and aggregators, including big names such as Playtech, IGT, Hub88, Reevo, Groove and AzureTech.\n“Lauryn’s experience, network and passion for delivering excellence, coupled with the fact that we are perfectly aligned with our vision for the future of Peter & Sons, makes her the perfect candidate for this role.”"
}