{
  "title": "Yann Bautista: Peter & Sons is on its own path of slot creativity",
  "slug": "yann-bautista-peter-sons-is-on-its-own-path-of-slot-creativity",
  "date": "2024-02-01",
  "image": "/uploads/News-3.png",
  "excerpt": "Yann Bautista: Peter & Sons is on its own path of slot creativity What’s the back story to Peter & Sons? Who is behind the",
  "content": "Yann Bautista: Peter & Sons is on its own path of slot creativity What’s the back story to Peter & Sons? Who is behind the",
  "fullContent": "What’s the back story to Peter & Sons? Who is behind the studio and where did the name come from?\nThe Peter & Sons story begins in 2019 when six people with tons of experience in mobile casino and game development came together to launch a studio with a difference. A few of us had previously worked together in a similar venture part of a major online casino operator. We knew we had what it took to create thrilling games that would stand out in game lobbies, and we knew that we worked well together. With that, Peter & Sons was born. As for the name, we wanted something that would inspire tradition, a label that conjured the image of a century-old family business transitioning from retail slot machines to online casino games.\nHow have you developed your company, its culture and indeed the Peter & Sons brand?\nFrom the get-go, we identified five pillars that each project, hire and decision would be based on. The first iscreativity to the core– creativity is not just what we do, it’s how we do it. This means trying new things, pushing boundaries for players and ensuring that our games keep moving the industry forward. The second pillar isanti-boring. Life is too short to be just another games company doing more of the same. We are here to walk our own path, stand out from the crowd and leave our mark. The third pillar is tosweat the small stuff. We leave no stone unturned in our pursuit of perfection. We are laser-focused on the details that make a difference to players and our partners. Pillar four iseasy does it. We are super easy to work with and always get the job done. Our games are easy to spot in the lobby, easy to play and easy to enjoy. The last pillar isplayer-obsessed. We are committed to improving the player experience of our games because we want to be their first choice each time they enter the casino game lobby.\nYou operate in a highly competitive market so how do you ensure your games stand out?\nAs veterans of this remarkable industry, we are aware of and appreciate the competitive landscape we operate in. In addition to our pillars, we also took the decision that wherever as a studio we can control and affect, we will do it in the most positive way. From game production, to commercial engagement, to support – we try to go the extra mile in all touch points with our partners in order to increase the value of our services and consequently the performance of the partners.\nIs there a Peter & Sons hallmark that players can instantly recognise when experiencing one of your games?\nWe have come to learn that both players and operators can instantly spot a Peter & Sons game due to our unique style. Our logo really stands out, too, and sticks in players’ minds. We actually use our logo in some pretty cool ways and try to implement it in each title, sort of like an easter egg in a movie. The Peter & Sons goat can be found in each title, whether that’s on the loading screen, as an in-game character, on symbols or even on win coins. Some call it subliminal messaging, we call it savvy marketing.\nIt also helps that we have a very successful title  in our portfolio. Barbarossa has become something of a flagship title and attracts a lot of attention from players and the wider industry. Unlike the usual churn curve of a slot, Barbarossa is showing elements of being a hit with a stable cohort of players that keep returning month in month out. We are working on a follow-up, Barbarossa 2, that will take the player experience to the next level and with even more big win potential.\nHow are you differentiating through game mechanics? Is this the most important area for a studio to differentiate?\nFor us, the magic is found in combining existing mechanics with new concepts and visuals to create a new player experience. For example, on our next run of games, we will be including special features around blocks – gameplay we initially introduced in Frozen Age – and more advanced mechanics around multipliers, as we did in Peter Hunter. We also have some classic slots in the works with consolidated mechanics including our twist on the fishing format. Mechanics are important, but if you look at the top-grossing games from the leading providers, they are mostly adaptations of existing mechanics.\nHow do you ensure your games appeal to a broad player audience?\nWe are all passionate about slot games and while our tastes differ, we know what matters most to players. This guides our mission as a studio, which is as simple as it is clear. And that is to curate a diverse portfolio that caters to the unique preferences of different players across different markets. We are unwavering in our dedication to achieving excellence in every aspect of game production. We don’t settle for the ordinary and instead meticulously study existing games in search of areas of improvement while drawing inspiration from our favourites. Reskins are a no-go for us. We take a quality-over-quantity approach and take great pride in delivering distinct experiences with each game we create.\nThis means we are always innovating to craft games that are not only fresh and captivating, but that are also infused with smart features. More than just mechanics, our emphasis is on seamlessly integrating these features into thematic elements within the game. The graphical presentation of these mechanical features is carefully curated to elevate the overall game experience, taking players on an amazing adventure with each spin of the reels.\nCan you tell us more about SkillOnNet’s investment in Peter & Sons? How did this come about and how is it benefiting both parties?\nPeter & Sons has basically become the content arm of SkillOnNet, which frankly brings some incredible perks for a relatively young studio. The first major upside is that we enjoy the resources that a tier one group such as SkillOnNet has at its disposal. This covers everything from accounting to legal and compliance. This support allows us to focus on what we do best, and that is producing brilliant games.\nMore importantly, we can leverage the dozens of local licences that SkillOnNet holds to deploy our content in regulated markets across the globe. At this point in our journey, this is a position we never expected to be in. Young studios struggle to obtain one or two licences in the early days, but we are already in a position to distribute in some of the biggest global markets including the UK, Spain, Denmark, Sweden, Ontario, Italy, Portugal, Germany and Greece, not to mention those that are in the pipeline including New Jersey, Peru, Brazil and more. This allows us to cater to tier-one operators via a single integration into multiple markets.\n2023 was a big year for you. Can you share one or two major highlights?\nThe year started with the SkillOnNet investment and ended with Peter & Sons move on to the next chapter of its success story. This progression saw us move from distributing only via the Yggdrasil Master Program and the Relax Silver Bullet to getting our own platform and RGS. This in turn allows us to create brilliant partnerships and integrations with some of the best aggregators and operators in the space including Relax, Hub88, IGT and Playtech. We have also launched a new websitehttps://peterandsonsgames.com, grown the team and secured certifications and licences. This has put an incredibly solid foundation in place for 2024 and beyond."
}