{
  "title": "Yggdrasil and Peter & Sons reveal infectious gameplay in Mutagenes",
  "slug": "yggdrasil-and-peter-sons-reveal-infectious-gameplay-in-mutagenes",
  "date": "2024-08-08",
  "image": "/uploads/Mutagenez_Facebook_post_1200x630px2-1.png",
  "excerpt": "Yggdrasil and Peter & Sons reveal infectious gameplay in Mutagenes Leading iGaming publisher Yggdrasil and YGG Masters partner Peter & Sons have opened the doors",
  "content": "Yggdrasil and Peter & Sons reveal infectious gameplay in Mutagenes Leading iGaming publisher Yggdrasil and YGG Masters partner Peter & Sons have opene",
  "fullContent": "Leading iGaming publisher Yggdrasil and YGG Masters partner Peter & Sons have opened the doors to a deep space laboratory in their latest collaborative release,Mutagenes.\nThe 6-reel, 4,069 ways to win cascading slot can see players win up to 12,000x their stake by way of the infection feature, free spins, increasing win multipliers and expanding wilds.\nAt random points during base and free spins gameplay, any low or mid-paying symbols can become infected and will automatically mutate into high-paying symbols, potentially leading to impressive winning payouts.\nUp to a total of 13 free spins can be triggered by landing between three and six scatter symbols anywhere on the game reels. During this bonus, a multiplier is applied to all wins. The multiplier starts at x1 and increases by one with each win thereafter, remaining once the feature ends.\nAny time a wild symbol appears on the reels it can potentially expand, filling up to an entire reel. Expanding wilds can occur on any reel except for the first during both base gameplay and free spins.\nPlayers wishing to increase their chances of winning can pay an additional 0.5x their stake as a Golden Bet. This boosts the chances of wild symbols randomly expanding. A buy bonus also allows players to automatically trigger between seven and 13 free spins in certain jurisdictions.\nMutagenesis powered by GATI, Yggdrasil’s state-of-the-art technology enabling partners to employ the preconfigured, regulation-ready, standardised development toolkit to consistently produce cutting-edge content followed by rapid distribution.\nZoe Bird, Head of Masters at Yggdrasil, said: “The talented team at Peter & Sons always knock it out of the park with their fantastic content, butMutagenesis most definitely out of this world! This game will appeal to players looking for a combination of great visuals and gameplay.”\nYann Bautista, Commercial Director & Founder at Peter & Sons, said:“Mutagenesis infectious! Despite its somewhat unsettling setting, we are confident that players will fall in love with."
}